# a=["北京","上海","广东"]
# b=["重庆","哈尔滨",
# "长春","沈阳","呼和浩特","石家庄","乌鲁木齐","兰州","西宁"
#      ,"西安","银州","郑州","济南","太原","合肥","长沙","武汉","南京","成都","贵阳","昆明",
#      "南宁","拉萨","杭州","南昌","广州","福州","台北","海口","香港","澳门"]
# c=[]

#
# c=a+b
# c.remove("广东")
# c.insert(1,"广东")
# print(c)

# i=0
# sum=0
# d=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# while i<8:
#     sum=sum+d[i]
#     i=i+1
#
# print("总和")
# print(sum)
# print("平均值")
# print(sum/8)

#有以下一个列表，求其中是5的倍数的和
# a = [1,5,21,30,15,9,30,24]
# i=0
# sum=0
# while i<7:
#     if a[i] % 5 == 0:
#         sum = sum + a[i]
#     i=i+1
# print(sum)

#有下列列表，请编程实现列表的数据翻转（京东金融的测试开发笔试题）
# List = [1,2,3,4,5,6,7,8,9]
# 实现效果：list = [9,8,7,6,5,4,3,2,1]

# list=[1,2,3,4,5,6,7,8,9]
# i=1
# list1=[]
# # list.reverse()
# while i<10:
#     list1.insert(0,i)
#     i=i+1
# print(list1)


#请编程统计列表中的每个数字出现的次数(百度初级测试开发笔试题)
#List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
list = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
j=0
k=0
a=0
n=0
while k<15:
    a=list[0]
    while j<15-k:
       if a==list[j]:
         n=n+1
         list.pop(j)
         k = k + 1
         j=j-1
    j = j+1
print(a,":",n)


